---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.DockablePaneProviderData
source: html/40547e39-eb96-be34-5bea-ada725e60503.htm
---
# DockablePaneProviderData Members

Initializes a new instance of the DockablePaneProviderData class